tsung/simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1000"/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
    <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
    <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
    <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
    <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
 </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>

    <option name="file_server" value="PATH_PLACEHOLDER" id="test"/>

  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- the user first go to the root to look at our website -->
      <request>
        <http url="/" version="1.1" method="GET"></http>
      </request>

      <!-- the user took a look at our sign up page; very intrigued! -->
      <request>
        <http url="/users/sign_up" version="1.1" method="GET"></http>
      </request>
      <thinktime value="10" random="true"/>
      <!-- they decided to sign up -->
      <setdynvars sourcetype="file" fileid="test" delimiter="," order="random">
        <var name="user_email"/>
        <var name="user_user_name"/>
        <var name="user_password"/>
      </setdynvars>


      <request subst="true">
        <http url="/users" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="user%5Bemail%5D=%%_user_email%%%40abc.com&amp;user%5Busername%5D=%%_user_user_name%%&amp;user%5Bpassword%5D=%%_user_password%%&amp;user%5Bpassword_confirmation%5D=%%_user_password%%&amp;commit=Sign+up"></http>
      </request>

      <request>
        <http url="/users/sign_out" version="1.1" method="DELETE" content_type="application/x-www-form-urlencoded"/>
      </request>

      <!-- then they go to the log in page -->
      <request>
        <http url="/users/sign_in" version="1.1" method="GET"></http>
      </request>
      <!-- add in a typing time because not everybody has a type speed of 200 WPM; I am jelly -->
      <thinktime value="10" random="true"></thinktime>
      <!-- then they actually send in the log in request -->
      <request subst="true">
        <http url="/users/sign_in" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="user%5Bemail%5D=%%_user_email%%%40abc.com&amp;user%5Bpassword%5D=%%_user_password%%"></http>
      </request>

    </session>
  </sessions>
</tsung>